marcoveeneman/ChibiOS-Tiva/os/hal/ports/SPC5/SPC5xx/eMIOS200_v1/icu_lld.c
/*
    SPC5 HAL - Copyright (C) 2013 STMicroelectronics

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    SPC5xx/eMIOS200_v1/icu_lld.c
 * @brief   SPC5xx low level icu driver code.
 *
 * @addtogroup ICU
 * @{
 */

#include "hal.h"

#if HAL_USE_ICU || defined(__DOXYGEN__)

#include "spc5_emios.h"

/*===========================================================================*/
/* Driver local definitions.                                                 */
/*===========================================================================*/

/*===========================================================================*/
/* Driver exported variables.                                                */
/*===========================================================================*/

/**
 * @brief   ICUD1 driver identifier.
 * @note    The driver ICUD1 allocates the unified channel eMIOS_CH1
 *          when enabled.
 */
#if SPC5_ICU_USE_EMIOS_CH1 || defined(__DOXYGEN__)
ICUDriver ICUD1;
#endif

/**
 * @brief   ICUD2 driver identifier.
 * @note    The driver ICUD2 allocates the unified channel eMIOS_CH2
 *          when enabled.
 */
#if SPC5_ICU_USE_EMIOS_CH2 || defined(__DOXYGEN__)
ICUDriver ICUD2;
#endif

/**
 * @brief   ICUD3 driver identifier.
 * @note    The driver ICUD3 allocates the unified channel eMIOS_CH3
 *          when enabled.
 */
#if SPC5_ICU_USE_EMIOS_CH3 || defined(__DOXYGEN__)
ICUDriver ICUD3;
#endif


/**
 * @brief   ICUD4 driver identifier.
 * @note    The driver ICUD4 allocates the unified channel eMIOS_CH4
 *          when enabled.
 */
#if SPC5_ICU_USE_EMIOS_CH4 || defined(__DOXYGEN__)
ICUDriver ICUD4;
#endif

/**
 * @brief   ICUD5 driver identifier.
 * @note    The driver ICUD5 allocates the unified channel eMIOS_CH5
 *          when enabled.
 */
#if SPC5_ICU_USE_EMIOS_CH5 || defined(__DOXYGEN__)
ICUDriver ICUD5;
#endif

/**
 * @brief   ICUD6 driver identifier.
 * @note    The driver ICUD6 allocates the unified channel eMIOS_CH6
 *          when enabled.
 */
#if SPC5_ICU_USE_EMIOS_CH6 || defined(__DOXYGEN__)
ICUDriver ICUD6;
#endif

/**
 * @brief   ICUD7 driver identifier.
 * @note    The driver ICUD7 allocates the unified channel eMIOS_CH11
 *          when enabled.
 */
#if SPC5_ICU_USE_EMIOS_CH11 || defined(__DOXYGEN__)
ICUDriver ICUD7;
#endif

/**
 * @brief   ICUD8 driver identifier.
 * @note    The driver ICUD8 allocates the unified channel eMIOS_CH13
 *          when enabled.
 */
#if SPC5_ICU_USE_EMIOS_CH13 || defined(__DOXYGEN__)
ICUDriver ICUD8;
#endif

#if SPC5_EMIOS_NUM_CHANNELS == 24
/**
 * @brief   ICUD9 driver identifier.
 * @note    The driver ICUD9 allocates the unified channel eMIOS_CH7
 *          when enabled.
 */
#if SPC5_ICU_USE_EMIOS_CH7 || defined(__DOXYGEN__)
ICUDriver ICUD9;
#endif

/**
 * @brief   ICUD10 driver identifier.
 * @note    The driver ICUD10 allocates the unified channel eMIOS_CH16
 *          when enabled.
 */
#if SPC5_ICU_USE_EMIOS_CH16 || defined(__DOXYGEN__)
ICUDriver ICUD10;
#endif

/**
 * @brief   ICUD11 driver identifier.
 * @note    The driver ICUD11 allocates the unified channel eMIOS_CH17
 *          when enabled.
 */
#if SPC5_ICU_USE_EMIOS_CH17 || defined(__DOXYGEN__)
ICUDriver ICUD11;
#endif

/**
 * @brief   ICUD12 driver identifier.
 * @note    The driver ICUD12 allocates the unified channel eMIOS_CH18
 *          when enabled.
 */
#if SPC5_ICU_USE_EMIOS_CH18 || defined(__DOXYGEN__)
ICUDriver ICUD12;
#endif
#endif

/*===========================================================================*/
/* Driver local variables and types.                                         */
/*===========================================================================*/

/**
 * @brief   Width and Period registers.
 */
uint32_t width;
uint32_t period;

/**
 * @brief   A2 temp registers.
 */
uint32_t A2_1, A2_2, A2_3;

/*===========================================================================*/
/* Driver local functions.                                                   */
/*===========================================================================*/

/**
 * @brief               ICU IRQ handler.
 *
 * @param[in] icup      pointer to the @p ICUDriver object
 */
static void icu_lld_serve_interrupt(ICUDriver *icup) {

  uint32_t sr = icup->emiosp->CH[icup->ch_number].CSR.R;

  if (sr && EMIOSS_OVFL && icup->config->overflow_cb != NULL) {
    icup->emiosp->CH[icup->ch_number].CSR.R |= EMIOSS_OVFLC;
    _icu_isr_invoke_overflow_cb(icup);
  }
  if (sr && EMIOSS_FLAG) {
    icup->emiosp->CH[icup->ch_number].CSR.R |= EMIOSS_FLAGC;
    if (icup->config->mode == ICU_INPUT_ACTIVE_HIGH) {
      if (icup->emiosp->CH[icup->ch_number].CSR.B.UCIN == 1U  &&            \
          icup->config->period_cb != NULL) {
        A2_3 = icup->emiosp->CH[icup->ch_number].CADR.R;
        period = A2_3 - A2_1;
        _icu_isr_invoke_period_cb(icup);
        A2_1 = A2_3;
      } else if (icup->emiosp->CH[icup->ch_number].CSR.B.UCIN == 0 &&       \
          icup->config->width_cb != NULL) {
        A2_2 = icup->emiosp->CH[icup->ch_number].CADR.R;
        width = A2_2 - A2_1;
        _icu_isr_invoke_width_cb(icup);
      }
    } else if (icup->config->mode == ICU_INPUT_ACTIVE_LOW) {
      if (icup->emiosp->CH[icup->ch_number].CSR.B.UCIN == 1U &&             \
          icup->config->width_cb != NULL) {
        A2_2 = icup->emiosp->CH[icup->ch_number].CADR.R;
        width = A2_2 - A2_1;
        _icu_isr_invoke_width_cb(icup);
      } else if (icup->emiosp->CH[icup->ch_number].CSR.B.UCIN == 0 &&       \
          icup->config->period_cb != NULL) {
        A2_3 = icup->emiosp->CH[icup->ch_number].CADR.R;
        period = A2_3 - A2_1;
        _icu_isr_invoke_period_cb(icup);
        A2_1 = A2_3;
      }
    }
  }
  if (sr && EMIOSS_OVR) {
    icup->emiosp->CH[icup->ch_number].CSR.R |= EMIOSS_OVRC;
  }

